robotology/icub-firmware/emBODY/arch-armcmx/body/abslayer/hal-package/hal/hal-src/stm32fx/brdcfg/hal_brdcfg_mcbstm32f400.c
#endif//HAL_USE_CAN

#ifdef HAL_USE_CRC
    extern const uint8_t hal_brdcfg_crc__supported_mask             = 0x03;
#endif//HAL_USE_CRC

#ifdef HAL_USE_DISPLAY
    extern const uint8_t hal_brdcfg_display__supported_mask         = 0x00;
#endif//HAL_USE_DISPLAY

#ifdef HAL_USE_ETH
    extern const uint8_t hal_brdcfg_eth__supported_mask             = 0x01;
    
    extern const hal_gpio_cfg_t hal_brdcfg_eth__gpio_ETH_RMII_REF_CLK   = { .port = hal_gpio_portA, .pin = hal_gpio_pin1,   .dir = hal_gpio_dirALT, .speed = hal_gpio_speed_max  }; 
    
    extern const hal_gpio_cfg_t hal_brdcfg_eth__gpio_ETH_RMII_TX_EN     = { .port = hal_gpio_portG, .pin = hal_gpio_pin11,  .dir = hal_gpio_dirALT, .speed = hal_gpio_speed_max };
    extern const hal_gpio_cfg_t hal_brdcfg_eth__gpio_ETH_RMII_TXD0      = { .port = hal_gpio_portG, .pin = hal_gpio_pin13,  .dir = hal_gpio_dirALT, .speed = hal_gpio_speed_max };
    extern const hal_gpio_cfg_t hal_brdcfg_eth__gpio_ETH_RMII_TXD1      = { .port = hal_gpio_portG, .pin = hal_gpio_pin14,  .dir = hal_gpio_dirALT, .speed = hal_gpio_speed_max };
    
    extern const hal_gpio_cfg_t hal_brdcfg_eth__gpio_ETH_RMII_CRS_DV    = { .port = hal_gpio_portA, .pin = hal_gpio_pin7,   .dir = hal_gpio_dirALT, .speed = hal_gpio_speed_max  };
    extern const hal_gpio_cfg_t hal_brdcfg_eth__gpio_ETH_RMII_RXD0      = { .port = hal_gpio_portC, .pin = hal_gpio_pin4,   .dir = hal_gpio_dirALT, .speed = hal_gpio_speed_max  };
    extern const hal_gpio_cfg_t hal_brdcfg_eth__gpio_ETH_RMII_RXD1      = { .port = hal_gpio_portC, .pin = hal_gpio_pin5,   .dir = hal_gpio_dirALT, .speed = hal_gpio_speed_max  };    
    
    extern const hal_gpio_cfg_t hal_brdcfg_eth__gpio_ETH_MDC            = { .port = hal_gpio_portC, .pin = hal_gpio_pin1,   .dir = hal_gpio_dirALT, .speed = hal_gpio_speed_max  };
    extern const hal_gpio_cfg_t hal_brdcfg_eth__gpio_ETH_MDIO           = { .port = hal_gpio_portA, .pin = hal_gpio_pin2,   .dir = hal_gpio_dirALT, .speed = hal_gpio_speed_max  };   
    
    extern const hal_eth_phymode_t hal_brdcfg_eth__phymode              = hal_eth_phymode_fullduplex100mbps;   
#endif//HAL_USE_ETH


#ifdef HAL_USE_EEPROM
    extern const uint8_t  hal_brdcfg_eeprom__supported_mask         = (1 << hal_eeprom_i2c_01);
    extern const uint32_t hal_brdcfg_eeprom__emflash_baseaddress    = 0x08000000;
    extern const uint32_t hal_brdcfg_eeprom__emflash_totalsize      = 0;
    extern const uint32_t hal_brdcfg_eeprom__i2c_01_baseaddress     = 0;
    extern const uint32_t hal_brdcfg_eeprom__i2c_01_totalsize       = 8*1024; 
    extern const hal_eeprom_hw_cfg_t hal_brdcfg_eeprom__i2c_01_device   =
    {
        .device             = hal_eeprom_device_st_m24lr64,
        .hwaddra2a1a0       = 0        // a0 = a1 = a2 = 0
    };        
#endif//HAL_USE_EEPROM 


#ifdef HAL_USE_ENCODER
    extern const uint32_t hal_brdcfg_encoder__supported_mask = 0x01ff; // tutti e 9 gli encoder ...
#endif//HAL_USE_ENCODER


#ifdef HAL_USE_GPIO
    extern const uint16_t hal_brdcfg_gpio__supported_mask[hal_gpio_ports_number]    =
    {   // ok, i enable every pin of every port. however i should enable only those used a true gpio
        0xffff,     // port a
        0xffff,     // port b
        0xffff,     // port c
        0xffff,     // port d
        0xffff,     // port e
        0xffff,     // port f
        0xffff,     // port g
        0xffff,     // port h
        0xffff      // port i
    };
#endif//HAL_USE_GPIO

#ifdef HAL_USE_I2C
    extern const uint8_t hal_brdcfg_i2c__supported_mask = (1 << hal_i2c_port1); 
    extern const hal_gpio_cfg_t hal_brdcfg_i2c__scl[]               =
    {
       {
            .port       = hal_gpio_portB,
            .pin        = hal_gpio_pin8,        
            .dir        = hal_gpio_dirALT,
            .speed      = hal_gpio_speed_default
        },
        {
            .port       = hal_gpio_portNONE,
            .pin        = hal_gpio_pinNONE,        
            .dir        = hal_gpio_dirALT,
            .speed      = hal_gpio_speed_default
        }            
    };
        
    extern const hal_gpio_cfg_t hal_brdcfg_i2c__sda[]               =
    {
        {
            .port       = hal_gpio_portB,
            .pin        = hal_gpio_pin9,        
            .dir        = hal_gpio_dirALT,
            .speed      = hal_gpio_speed_default
        }, 
        {
            .port       = hal_gpio_portNONE,
            .pin        = hal_gpio_pinNONE,        
            .dir        = hal_gpio_dirALT,
            .speed      = hal_gpio_speed_default
        }        
    };
    
    extern const hal_i2c_hw_cfg_t  hal_brdcfg_i2c__hwcfg        =
    {
        .speed          = hal_i2c_speed_400kbps,      
        .scl            = 
        {
            .port       = hal_gpio_portB,
            .pin        = hal_gpio_pin8,        
            .dir        = hal_gpio_dirALT,
            .speed      = hal_gpio_speed_default
        },
        .sda            =
        {
            .port       = hal_gpio_portB,
            .pin        = hal_gpio_pin9,        
            .dir        = hal_gpio_dirALT,
            .speed      = hal_gpio_speed_default
        },        
        .usedma         = hal_false,
        .ontimeout      = NULL   
    };  
    
#endif//HAL_USE_I2C


#ifdef HAL_USE_LED
    extern const hal_gpio_val_t hal_brdcfg_led__value_on          = hal_gpio_valHIGH;
    extern const hal_gpio_val_t hal_brdcfg_led__value_off         = hal_gpio_valLOW;
    extern const uint8_t hal_brdcfg_led__supported_mask           = 0xFF;
    extern const hal_gpio_cfg_t hal_brdcfg_led__cfg[hal_leds_num] = 
    {
        {   // hal_led0 
            .port     = hal_gpio_portH,
            .pin      = hal_gpio_pin2,        
            .dir      = hal_gpio_dirOUT,
            .speed    = hal_gpio_speed_low
        },
        {   // hal_led1 
            .port     = hal_gpio_portG,
            .pin      = hal_gpio_pin8,        
            .dir      = hal_gpio_dirOUT,
            .speed    = hal_gpio_speed_low
        },
        {   // hal_led2 
            .port     = hal_gpio_portG,
            .pin      = hal_gpio_pin7,        
            .dir      = hal_gpio_dirOUT,
            .speed    = hal_gpio_speed_low
        },
        {   // hal_led3 
            .port     = hal_gpio_portG,
            .pin      = hal_gpio_pin6,        
            .dir      = hal_gpio_dirOUT,
            .speed    = hal_gpio_speed_low
        },
        {   // hal_led4 
            .port     = hal_gpio_portI,
            .pin      = hal_gpio_pin10,        
            .dir      = hal_gpio_dirOUT,
            .speed    = hal_gpio_speed_low
        },
        {   // hal_led5 
            .port     = hal_gpio_portH,
            .pin      = hal_gpio_pin7,        
            .dir      = hal_gpio_dirOUT,
            .speed    = hal_gpio_speed_low
        },
        {   // hal_led6 
            .port     = hal_gpio_portH,
            .pin      = hal_gpio_pin6,        
            .dir      = hal_gpio_dirOUT,
            .speed    = hal_gpio_speed_low
        }, 
        {   // hal_led7 
            .port     = hal_gpio_portH,
            .pin      = hal_gpio_pin3,        
            .dir      = hal_gpio_dirOUT,
            .speed    = hal_gpio_speed_low
        }  
    };
#endif//HAL_USE_LED

   
