robotology/icub-firmware/emBODY/arch-armcmx/body/abslayer/hal-package/hal/hal-src/stm32fx/brdcfg/hal_brdcfg_mcbstm32f400.c
#ifdef HAL_USE_SPI
    extern const uint8_t hal_brdcfg_spi__supported_mask             = (1 << hal_spi_port1) | (1 << hal_spi_port2) | (1 << hal_i2c_port3);

    extern const hal_gpio_cfg_t hal_brdcfg_spi__miso[]      =
    {
        {   // spi1
            .port     = hal_gpio_portA, 
            .pin      = hal_gpio_pin6,        
            .dir      = hal_gpio_dirALT,
            .speed    = hal_gpio_speed_default
        },
        
        {   // spi2
            .port     = hal_gpio_portC, 
            .pin      = hal_gpio_pin2,        
            .dir      = hal_gpio_dirALT,
            .speed    = hal_gpio_speed_default        
        },
        {   // spi3
            .port     = hal_gpio_portB, 
            .pin      = hal_gpio_pin4,        
            .dir      = hal_gpio_dirALT,
            .speed    = hal_gpio_speed_default        
        }        
    };
    extern const hal_gpio_cfg_t hal_brdcfg_spi__mosi[]      =
    {
        {   // spi1
            .port     = hal_gpio_portB, 
            .pin      = hal_gpio_pin5,        
            .dir      = hal_gpio_dirALT,
            .speed    = hal_gpio_speed_default
        },
        
        {   // spi2
            .port     = hal_gpio_portC, 
            .pin      = hal_gpio_pin3,        
            .dir      = hal_gpio_dirALT,
            .speed    = hal_gpio_speed_default        
        },
        {   // spi3
            .port     = hal_gpio_portC, 
            .pin      = hal_gpio_pin12,        
            .dir      = hal_gpio_dirALT,
            .speed    = hal_gpio_speed_default        
        }     
    };
    extern const hal_gpio_cfg_t hal_brdcfg_spi__sck[]      =
    {
        {   // spi1
            .port     = hal_gpio_portA, 
            .pin      = hal_gpio_pin5,        
            .dir      = hal_gpio_dirALT,
            .speed    = hal_gpio_speed_default
        },
        
        {   // spi2
            .port     = hal_gpio_portB, 
            .pin      = hal_gpio_pin10,        
            .dir      = hal_gpio_dirALT,
            .speed    = hal_gpio_speed_default        
        },
        {   // spi3
            .port     = hal_gpio_portC, 
            .pin      = hal_gpio_pin10,        
            .dir      = hal_gpio_dirALT,
            .speed    = hal_gpio_speed_default        
        }     
    };    
#endif//HAL_USE_SPI
    
#ifdef HAL_USE_SPI4ENCODER
    extern const uint8_t hal_brdcfg_spi4encoder__supported_mask = 0x07;  // tutte e 3 le spi 
#endif//HAL_USE_SPI4ENCODER
    
#ifdef  HAL_USE_SYS
    extern const hal_sys_hid_clock_cfg_t hal_brdcfg_sys__clockcfg =
    {
        .sourceclock        = hal_sys_refclock_pll_on_external_xtl,  
        .intclockspeed      = 16000000,
        .extclockspeed      = 25000000,
        .targetspeeds       =
        {   
            .cpu                = 168000000,
            .fastbus            =  84000000,
            .slowbus            =  42000000
        },
        .pllcfg             =
        {
            .m                  =  25, 
            .n                  = 336,
            .p                  = 2,
            .q                  = 7
        }
    };        
#endif//HAL_USE_SYS            
    
#ifdef HAL_USE_SWITCH
    extern const hal_boolval_t hal_brdcfg_switch__supported         = hal_false;
#endif//HAL_USE_SWITCH
    
#ifdef HAL_USE_TIMER
    extern const uint8_t hal_brdcfg_timer__supported_mask           = 
    (0 << hal_timer1) | (1 << hal_timer2) | (1 << hal_timer3) | (1 << hal_timer4) |
    (1 << hal_timer5) | (1 << hal_timer6) | (1 << hal_timer7); // timer1 is not enabled.
    #warning --> on stm32f4 there are more timers ...
#endif//HAL_USE_TIMER


#ifdef HAL_USE_WATCHDOG
    extern const uint8_t hal_brdcfg_watchdog__supported_mask        = (1 << hal_watchdog_normal) | (1 << hal_watchdog_window);
#endif//HAL_USE_WATCHDOG

// --------------------------------------------------------------------------------------------------------------------
// - typedef with internal scope
// --------------------------------------------------------------------------------------------------------------------
// empty-section

// --------------------------------------------------------------------------------------------------------------------
// - declaration of static functions
// --------------------------------------------------------------------------------------------------------------------
// empty-section


// --------------------------------------------------------------------------------------------------------------------
// - definition (and initialisation) of static variables
// --------------------------------------------------------------------------------------------------------------------
// empty-section


// --------------------------------------------------------------------------------------------------------------------
// - definition of extern public functions
// --------------------------------------------------------------------------------------------------------------------

#ifdef HAL_USE_CAN

extern void hal_brdcfg_can__phydevices_init(hal_can_port_t port)
{
    // nothing to do
    hal_brdcfg_can__phydevices_disable(port);
}

extern void hal_brdcfg_can__phydevices_enable(hal_can_port_t port)
{   
    // nothing to do
}

extern void hal_brdcfg_can__phydevices_disable(hal_can_port_t port)
{
    // nothing to do
}

#endif//HAL_USE_CAN






#ifdef HAL_USE_EEPROM

extern hal_result_t hal_brdcfg_eeprom__wp_init(void)
{
    return(hal_res_OK);
}

extern hal_result_t hal_brdcfg_eeprom__wp_enable(void)
{
    return(hal_res_OK);
}

extern hal_result_t hal_brdcfg_eeprom__wp_disable(void)
{
    return(hal_res_OK);
}

#endif//HAL_USE_EEPROM





#ifdef HAL_USE_SPI4ENCODER

/*Note: if there will be some speed problems, you can try to transform  hal_brdcfg_spi4encoder__encoder_enable and  hal_brdcfg_spi4encoder__encoder_disable as inline function,
but pay attention with the project with scatter file.probably it will give you trouble*/

extern void hal_brdcfg_spi4encoder__encoder_enable(hal_spi_port_t spix, hal_spi_mux_t e)
{
	HAL_BRDCFG_SPI4ENCODER__SPI_CS_ENA(spix, e)
}

extern void hal_brdcfg_spi4encoder__encoder_disable(hal_spi_port_t spix, hal_spi_mux_t e)
{
	HAL_BRDCFG_SPI4ENCODER__SPI_CS_DISA(spix, e)
}

extern void hal_brdcfg_spi4encoder__chipSelect_init(hal_spi_port_t spix )
{
    GPIO_InitTypeDef  GPIO_InitStructure;

	
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;	 //Output push-pull mode
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;


